// Напишіть гру Камінь - Ножиці - Папір - Ящирка - Спок використовуючи рядки

#include <iostream>
#include <ctime>
#include <string>
#include <Windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    srand(time(NULL));
    string player;          //Строка у якій кор вводить свій варіант
                
    cout << "\t--Камінь-Ножниці-Папір-Ящірка-Спок--"<<endl;             //Назва гри та правила
    cout << endl;
    cout << "Правила наступні: "<<endl;
    cout << "Напиши елемент який обераєш ти, це може бути: "<<endl;
    cout << "- Камінь --(Виграє у ножниці та Ящірки. Програє Спок та Папір)"<<endl;
    cout << "- Ножниці -- (Виграє у Папір та Ящірки. Програє Спок та Камінь)" << endl;
    cout << "- Папір -- (Виграє у Камінь та Спок. Програє Ножниці та Ящірка)" << endl;
    cout << "- Ящірка -- (Виграє у Папір та Спок. Програє Ножниці та Камінь)" << endl;
    cout << "- Спок -- (Виграє у Камінь та Ножниці. Програє Ножниці та Ящірка)" << endl;
    cout << "Стоп - Вихід." << endl;
    cout << endl;
    cout << "Ну що, починаємо. Tвій вибір це :"<<endl;


    while (player != "Стоп") {          //коли гравець напише СТОП - кінець гри 
        
        int k = rand() % 5;         //Рандомний вибір комп ютера 
        string compValue;           //Строка для вибора компа 
        if (k == 0) {   
            compValue = "Камінь";   //якщо комп вибере 0 -значить його вибір це камінь
        }
        else if (k == 1) {
            compValue = "Ножниці";  //якщо комп вибере 1 -значить його вибір це ножниці
        }
        else if (k == 2) {
            compValue = "Папір";       //якщо комп вибере 2 -значить його вибір це Папір
        }
        else if (k == 3) {
            compValue = "Ящірка";   //якщо комп вибере 3 -значить його вибір це Ящірка
        }
        else if (k == 4) {
            compValue = "Спок";         //якщо комп вибере 4 -значить його вибір це Спока
        }

        getline(cin, player);       //строка для введення даних користувачем(вибір кор.)

        if (player == compValue) {      //Якщо вібір кор та комп буде однаковий 
            cout << " Комп вибрав - " << compValue << endl;         //нічия
            cout << "Нічия" << endl;
            cout << endl;
            Sleep(1000); cout << "Давай ще раз, напиши свій варіант:" << endl;  //Цікава ф-ція з інету з затримкою виведення на екран(у мілісек)
        }
        else if (player == "Камінь" && compValue == "Ножниці" || compValue =="Ящірка" || player == "Ножниці" && compValue == "Папір"|| compValue == "Ящірка" || player == "Папір" && compValue == "Камінь" || compValue == "Спок" || player == "Ящірка" && compValue == "Папір" || compValue == "Спок" || player == "Спок" && compValue == "Камінь" || compValue == "Ножниці") {
            cout << " Комп вибрав - " << compValue << endl;         //вище вказана умова виграшу користувачем 
            cout << "   Перемога!!!" << endl;
            cout << endl;
            Sleep(1000); cout << "Давай ще раз, напиший свій варіант:" << endl;
        }
        else {
            cout << " Комп вибрав - " << compValue << endl;     //якщо умова виграшу не спрацювала - автоматично включається умова поразки 
            cout << "  Поразка ..." << endl;
            cout << endl;
            Sleep(1000); cout << "Давай ще раз, напиший свій варіант:" << endl;
        }
    }

}
